# RbsElecRoomLightingCalcWorkplane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecRoomLightingCalcWorkplane Property
ParameterTypeId Class See Also
---
"Lighting Calculation Workplane"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecRoomLightingCalcWorkplane { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecRoomLightingCalcWorkplane As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecRoomLightingCalcWorkplane {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace